ZADANI 1

""" takto bych si to načetla podle vzoru z adres dole:
jmena = pandas.read_csv("https://kodim.cz/cms/assets/kurzy/python-data-1/python-pro-data-1/agregace-a-spojovani/excs/excs>studenti/jmena.csv")
s1 = pandas.read_csv("https://kodim.cz/cms/assets/kurzy/python-data-1/python-pro-data-1/agregace-a-spojovani/excs/excs>studenti/studenti1.csv")
s2 = pandas.read_csv("https://kodim.cz/cms/assets/kurzy/python-data-1/python-pro-data-1/agregace-a-spojovani/excs/excs>studenti/studenti2.csv") 
 [zam_praha.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_praha.csv),
 [zam_plzeň.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_plzeň.csv)
 [zam_liberec.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_liberec.csv).
 [platy_2021_02.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/platy_2021_02.csv)

"""

In [26]:
import pandas

načti data o zaměstnancích z CSV souborů do tabulek

In [27]:
zam_plzen = pandas.read_csv("zam_plzen.csv")
zam_plzen.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance
0     Stacy  Pospíšilová       727 293 880                  3
1     Matěj         Král       770 787 377                  6
2    Amanda       Wilson  +421 52 656 7231                  7
3     Angel       Wilson  +421 52 135 2491                  8
4  Jindřich       Howell  +421 39 043 0948                 10

In [28]:
zam_praha = pandas.read_csv("zam_praha.csv")
zam_praha.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance
0     Brian      Hall  +421 949 656 098                 30
1     Marta  Kolářová       730 456 163                 32
2      John   Moravec       725 092 179                 33
3  Dominika   Kopecká       722 747 626                 34
4    Marcel     Hájek  +421 902 928 669                 35

In [29]:
zam_liberec = pandas.read_csv("zam_liberec.csv")
zam_liberec.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance
0       Nela      Šťastná       728 454 176                 83
1    Heather      Marková       604 404 522                 84
2     Krista  Procházková  +421 50 444 5544                 85
3   Jennifer        Brown       775 545 190                 86
4  Ladislava    Blackwell  +421 913 487 200                 87

ke každé tabulce přidej nový sloupec `mesto`, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje

In [30]:
zam_plzen["mesto"] = "plzen"
zam_plzen.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Stacy  Pospíšilová       727 293 880                  3  plzen
1     Matěj         Král       770 787 377                  6  plzen
2    Amanda       Wilson  +421 52 656 7231                  7  plzen
3     Angel       Wilson  +421 52 135 2491                  8  plzen
4  Jindřich       Howell  +421 39 043 0948                 10  plzen

In [31]:
zam_praha["mesto"] = "praha"
zam_praha.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Brian      Hall  +421 949 656 098                 30  praha
1     Marta  Kolářová       730 456 163                 32  praha
2      John   Moravec       725 092 179                 33  praha
3  Dominika   Kopecká       722 747 626                 34  praha
4    Marcel     Hájek  +421 902 928 669                 35  praha

In [32]:
zam_liberec["mesto"] = "liberec"
zam_liberec.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance    mesto
0       Nela      Šťastná       728 454 176                 83  liberec
1    Heather      Marková       604 404 522                 84  liberec
2     Krista  Procházková  +421 50 444 5544                 85  liberec
3   Jennifer        Brown       775 545 190                 86  liberec
4  Ladislava    Blackwell  +421 913 487 200                 87  liberec

vytvoř novou tabulku `zamestnanci` a ulož do ní informace o všech zaměstnancích -fce concat

In [33]:
zamestnanci = pandas.concat([zam_plzen, zam_praha, zam_liberec], ignore_index=True)
zamestnanci.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Stacy  Pospíšilová       727 293 880                  3  plzen
1     Matěj         Král       770 787 377                  6  plzen
2    Amanda       Wilson  +421 52 656 7231                  7  plzen
3     Angel       Wilson  +421 52 135 2491                  8  plzen
4  Jindřich       Howell  +421 39 043 0948                 10  plzen

ze souboru platy_2021_02.csv načti platy zaměstnanců za únor 2021

In [34]:
platy_2021_02 = pandas.read_csv("platy_2021_02.csv")
platy_2021_02.head()

   cislo_zamestnance     plat
0                  3  54900.0
1                  6  54800.0
2                  7  36400.0
3                  8  47900.0
4                 16  34200.0

propoj tabulku zamestnanci a platy_2021_02 - operace `join/merge` pomocí sloupce `cislo_zamestnance`

In [43]:
zamestnanci_s_platy_2021_02 = pandas.merge(zamestnanci, platy_2021_02, on="cislo_zamestnance", how="left")
zamestnanci_s_platy_2021_02.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance  mesto     plat
0     Stacy  Pospíšilová       727 293 880                  3  plzen  54900.0
1     Matěj         Král       770 787 377                  6  plzen  54800.0
2    Amanda       Wilson  +421 52 656 7231                  7  plzen  36400.0
3     Angel       Wilson  +421 52 135 2491                  8  plzen  47900.0
4  Jindřich       Howell  +421 39 043 0948                 10  plzen      NaN

porovnej rozměry tabulek před spojením a po spojení

In [36]:
pocet_zamestnancu = zamestnanci.count()
pocet_zamestnancu

jmeno                56
prijimeni            56
telefonni_cislo      56
cislo_zamestnance    56
mesto                56
dtype: int64

In [37]:
pocet_platy_2021_02=platy_2021_02.count()
pocet_platy_2021_02

cislo_zamestnance    43
plat                 43
dtype: int64

In [38]:
pocet_zamestnancu_s_platy_2021_02=zamestnanci_s_platy_2021_02.count()
pocet_zamestnancu_s_platy_2021_02

jmeno                56
prijimeni            56
telefonni_cislo      56
cislo_zamestnance    56
mesto                56
plat                 43
dtype: int64

pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje

In [45]:
pracujici = zamestnanci_s_platy_2021_02.dropna(subset=["plat"]) 
pracujici.count()

jmeno                43
prijimeni            43
telefonni_cislo      43
cislo_zamestnance    43
mesto                43
plat                 43
dtype: int64

spočti průměrný plat zaměstnanců v jednotlivých kancelářích

In [46]:
prumerny_plat_zamestnance_na_mesto = zamestnanci_s_platy_2021_02.groupby("mesto")["plat"].mean()
prumerny_plat_zamestnance_na_mesto

mesto
liberec    43775.000000
plzen      44792.857143
praha      43295.238095
Name: plat, dtype: float64

ZADANI 2

ze souboru vykazy.csv načti informace o výkazech na projekty pro jednoho vybraného zákazníka a ulož je do tabulky

In [48]:
vykazy = pandas.read_csv("vykazy.csv")
vykazy.head()

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70
2  2021-02-01    2.1     JL9          72
3  2021-02-01    5.2     F30           3
4  2021-02-01    2.4     TE1          54

proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty

In [60]:
pocet_hodin_na_projekt=vykazy.groupby("project")["hours"].sum()
pocet_hodin_na_projekt

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64

propoj tabulku s výkazy s tabulkou se zaměstnanci

In [57]:
pracujici_vykazy = pandas.merge(pracujici, vykazy, left_on="cislo_zamestnance", right_on ="emloyee_id")
pracujici_vykazy.head()

,jmeno,prijimeni,telefonni_cislo,cislo_zamestnance,mesto,plat,date,hours,project,emloyee_id
0,Stacy,Pospíšilová,727 293 880,3,plzen,54900.0,2021-02-01,5.2,F30,3
1,Miroslav,Reed,774 829 074,18,plzen,35400.0,2021-02-03,2.6,F30,18
2,Brian,Hall,+421 949 656 098,30,praha,33500.0,2021-02-01,4.4,W05,30
3,Dominika,Kopecká,722 747 626,34,praha,36800.0,2021-02-01,2.2,YLI,34
4,Dominika,Kopecká,722 747 626,34,praha,36800.0,2021-02-03,2.6,YLI,34

proveď statistiku vykázaných hodin za jednotlivé kanceláře, tj. spočítej celkový počet hodin vykázaný zaměstnanci jednotlivých kanceláří na projekty daného zákazníka

In [61]:
pocet_hodin_na_projekt_2 = pracujici_vykazy.groupby("project")["hours"].sum()
pocet_hodin_na_projekt_2

project
F30    13.4
TE1     9.0
W05    26.5
YLI    16.7
Name: hours, dtype: float64

In [69]:
from pandas import isnull


nepracujici = zamestnanci_s_platy_2021_02[zamestnanci_s_platy_2021_02["plat"].isnull()]
nepracujici.head()

        jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto  plat
4    Jindřich    Howell  +421 39 043 0948                 10  plzen   NaN
5   Alexander  Martinez       721 195 689                 13  plzen   NaN
20     Marcel     Hájek  +421 902 928 669                 35  praha   NaN
28   Karolína     Short       721 589 083                 53  praha   NaN
29   Michelle   Vlčková  +421 41 720 7806                 54  praha   NaN

In [71]:
nepracujici_vykazy = pandas.merge(nepracujici, vykazy, left_on="cislo_zamestnance", right_on ="emloyee_id")
nepracujici_vykazy.head()

,jmeno,prijimeni,telefonni_cislo,cislo_zamestnance,mesto,plat,date,hours,project,emloyee_id
0,Jindřich,Howell,+421 39 043 0948,10,plzen,NaN,2021-02-02,5.3,YLI,10
1,Alexander,Martinez,721 195 689,13,plzen,NaN,2021-02-01,2.5,F30,13
2,Karolína,Short,721 589 083,53,praha,NaN,2021-02-02,5.6,F30,53
3,Karolína,Short,721 589 083,53,praha,NaN,2021-02-02,3.6,YLI,53
4,Karolína,Short,721 589 083,53,praha,NaN,2021-02-03,4.0,W05,53

In [72]:
pocet_hodin_na_projekt_4 = nepracujici_vykazy.groupby("project")["hours"].sum()
pocet_hodin_na_projekt_4

project
F30     8.1
JL9     2.1
TE1     7.0
W05     4.0
YLI    14.3
Name: hours, dtype: float64

spočítej celkový počet hodin vykázaný zaměstnanci jednotlivých kanceláří na projekty daného zákazníka

In [88]:
pocet_hodin_na_projekt_5 = pracujici_vykazy.groupby(["mesto","project"]).agg({"hours":'sum'})
pocet_hodin_na_projekt_5

                 hours
mesto   project
liberec TE1        6.2
        W05        5.4
        YLI        6.4
plzen   F30        7.8
praha   F30        5.6
        TE1        2.8
        W05       21.1
        YLI       10.3